In [1]:
import pandas as pd
(pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd()).weekday()

5

In [2]:
import pandas as pd
pd.Period('01/12/2019', 'M') + 5

Period('2019-06', 'M')

In [1]:
# Vamos trabalhar com um ranking mundial de universidades.
import pandas as pd
import numpy as np

df = pd.read_csv('cwurData.csv')
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [2]:
# Vamos criar quatro categorias de universidades e transformá-las em uma nova coluna
# Da posição 1-100; 101-200; 201-300; 300 para cima

# Essa função inspecionará as posições de ranking de cada universidade
def rank2(ranking):
    if ranking in range(1, 101):
        return 'World Class University'
    elif ranking in range(101, 201):
        return 'Good University'
    elif ranking in range(201, 301):
        return 'Average University'
    else:
        return 'Ordinary University'
    
# Passando a colna 'world_rank' como argumento à 'rank2'
df['Rank Level'] = df['world_rank'].apply(rank2)
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,Rank Level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,World Class University
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,World Class University
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,World Class University
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,World Class University
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,World Class University

In [4]:
# No caso anterior, passamos apenas uma função de agregação. No entanto, somos permitidos a utilizar
# duas ou mais funções.

# Iremos descobrir, também, o 'score' da universidade mais bem avaliada por categoria.

df_new = df.pivot_table(values='score', index='country', columns='Rank Level', 
               aggfunc=[np.mean, np.max]).head()

df_new.head()

                         mean                                      \
Rank Level Average University Good University Ordinary University
country
Argentina                 NaN             NaN           44.672857
Australia           47.285000         49.2425           44.645750
Austria             47.066667             NaN           44.864286
Belgium             46.746667         49.0840           45.081000
Brazil                    NaN         49.5650           44.499706

                                                amax                  \
Rank Level World Class University Average University Good University
country
Argentina                     NaN                NaN             NaN
Australia                 47.9425              47.47           50.40
Austria                       NaN              47.78             NaN
Belgium                   51.8750              47.14           49.73
Brazil                        NaN                NaN           49.82


Rank Level Ordinary University World Class University
country
Argentina                45.66                    NaN
Australia                45.97                  51.61
Austria                  46.29                    NaN
Belgium                  46.21                  52.03
Brazil                   46.08                    NaN

In [14]:
display(df_new.unstack().unstack())

country                      Argentina  Australia    Austria    Belgium  \
     Rank Level
mean Average University            NaN   47.28500  47.066667  46.746667
     Good University               NaN   49.24250        NaN  49.084000
     Ordinary University     44.672857   44.64575  44.864286  45.081000
     World Class University        NaN   47.94250        NaN  51.875000
amax Average University            NaN   47.47000  47.780000  47.140000
     Good University               NaN   50.40000        NaN  49.730000
     Ordinary University     45.660000   45.97000  46.290000  46.210000
     World Class University        NaN   51.61000        NaN  52.030000

country                         Brazil
     Rank Level
mean Average University            NaN
     Good University         49.565000
     Ordinary University     44.499706
     World Class University        NaN
amax Average University            NaN
     Good University         49.820000
     Ordinary University     46.080000
     World Class University        NaN